src/cf/src/Documents/ВыплатаЗарплаты/ВыплатаЗарплаты.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>ВыплатаЗарплаты</name>
  <basedOn>Document.НачислениеЗарплаты</basedOn>
  <registerRecords>AccumulationRegister.Зарплата</registerRecords>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Основание</name>
    <type>
      <types>DocumentRef.НачислениеЗарплаты</types>
    </type>
  </attributes>
  <attributes>
    <name>Ответственный</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>Сумма</name>
    <type>
      <types>DefinedType.СуммаНеотрицательная</types>
    </type>
  </attributes>
  <attributes>
    <name>МестоХранения</name>
    <type>
      <types>CatalogRef.МестаХранения</types>
    </type>
  </attributes>
  <tabularSections>
    <name>ТЧСотрудники</name>
    <attributes>
      <name>Сотрудник</name>
      <type>
        <types>CatalogRef.ФизическиеЛица</types>
      </type>
    </attributes>
    <attributes>
      <name>Сумма</name>
      <type>
        <types>DefinedType.СуммаНеотрицательная</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

src/cf/src/InformationRegisters/ТарифныеСтавки/ТарифныеСтавки.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>ТарифныеСтавки</name>
  <informationRegisterPeriodicity>Month</informationRegisterPeriodicity>
  <writeMode>RecorderSubordinate</writeMode>
  <resources>
    <name>ВидПриказа</name>
    <type>
      <types>EnumRef.ВидыКадровыхПриказов</types>
    </type>
  </resources>
  <resources>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </resources>
  <resources>
    <name>Должность</name>
    <type>
      <types>CatalogRef.Должности</types>
    </type>
  </resources>
  <resources>
    <name>Оклад</name>
    <type>
      <types>DefinedType.СуммаНеотрицательная</types>
    </type>
  </resources>
  <resources>
    <name>ВариантОклада</name>
    <type>
      <types>EnumRef.ВариантыОклада</types>
    </type>
  </resources>
  <resources>
    <name>ГрафикРаботы</name>
    <type>
      <types>CatalogRef.ГрафикиРаботыСотрудников</types>
    </type>
  </resources>
  <resources>
    <name>МестоХранения</name>
    <type>
      <types>CatalogRef.МестаХранения</types>
    </type>
  </resources>
  <dimensions>
    <name>Сотрудник</name>
    <type>
      <types>CatalogRef.ФизическиеЛица</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

src/cf/src/AccumulationRegisters/Зарплата/Зарплата.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:AccumulationRegister>
  <name>Зарплата</name>
  <resources>
    <name>Сумма</name>
    <type>
      <types>DefinedType.Сумма</types>
    </type>
  </resources>
  <attributes>
    <name>СтатьяЗатрат</name>
    <type>
      <types>CatalogRef.СтатьиДвиженияДенежныхСредств</types>
    </type>
  </attributes>
  <dimensions>
    <name>Сотрудник</name>
    <type>
      <types>CatalogRef.ФизическиеЛица</types>
    </type>
  </dimensions>
</mdclass:AccumulationRegister>

src/cf/src/Documents/ПриказНаНачислениеУдержание/ПриказНаНачислениеУдержание.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>ПриказНаНачислениеУдержание</name>
  <registerRecords>AccumulationRegister.Зарплата</registerRecords>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Ответственный</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <tabularSections>
    <name>ТЧСотрудники</name>
    <attributes>
      <name>Сотрудник</name>
      <type>
        <types>CatalogRef.ФизическиеЛица</types>
      </type>
    </attributes>
    <attributes>
      <name>ВидНачисления</name>
      <type>
        <types>EnumRef.ВидыНачисленийЗарплаты</types>
      </type>
    </attributes>
    <attributes>
      <name>СтатьяЗатрат</name>
      <type>
        <types>CatalogRef.СтатьиДвиженияДенежныхСредств</types>
      </type>
    </attributes>
    <attributes>
      <name>Сумма</name>
      <type>
        <types>DefinedType.СуммаНеотрицательная</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

src/cf/src/Documents/НачислениеЗарплаты/НачислениеЗарплаты.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>НачислениеЗарплаты</name>
  <basedOn>Document.ТабельУчётаРабочегоВремени</basedOn>
  <registerRecords>AccumulationRegister.Убытки</registerRecords>
  <registerRecords>AccumulationRegister.Зарплата</registerRecords>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Основание</name>
    <type>
      <types>DocumentRef.ТабельУчётаРабочегоВремени</types>
    </type>
  </attributes>
  <attributes>
    <name>Ответственный</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>Сумма</name>
    <type>
      <types>DefinedType.СуммаНеотрицательная</types>
    </type>
  </attributes>
  <attributes>
    <name>МестоХранения</name>
    <type>
      <types>CatalogRef.МестаХранения</types>
    </type>
  </attributes>
  <tabularSections>
    <name>ТЧСотрудники</name>
    <attributes>
      <name>Сотрудник</name>
      <type>
        <types>CatalogRef.ФизическиеЛица</types>
      </type>
    </attributes>
    <attributes>
      <name>Оклад</name>
      <type>
        <types>DefinedType.СуммаНеотрицательная</types>
      </type>
    </attributes>
    <attributes>
      <name>Премия</name>
      <type>
        <types>DefinedType.Сумма</types>
      </type>
    </attributes>
    <attributes>
      <name>Прочее</name>
      <type>
        <types>DefinedType.Сумма</types>
      </type>
    </attributes>
    <attributes>
      <name>Сумма</name>
      <type>
        <types>DefinedType.Сумма</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

src/cf/src/Documents/ПлатёжнаяВедомостьНаАванс/ПлатёжнаяВедомостьНаАванс.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>ПлатёжнаяВедомостьНаАванс</name>
  <registerRecords>AccumulationRegister.Зарплата</registerRecords>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Ответственный</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>Сумма</name>
    <type>
      <types>DefinedType.СуммаНеотрицательная</types>
    </type>
  </attributes>
  <tabularSections>
    <name>ТЧСотрудники</name>
    <attributes>
      <name>Сотрудник</name>
      <type>
        <types>CatalogRef.ФизическиеЛица</types>
      </type>
    </attributes>
    <attributes>
      <name>Сумма</name>
      <type>
        <types>DefinedType.СуммаНеотрицательная</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

src/cf/src/Catalogs/СтатьиДвиженияДенежныхСредств/СтатьиДвиженияДенежныхСредств.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>СтатьиДвиженияДенежныхСредств</name>
  <hierarchical>true</hierarchical>
  <predefined>
    <items>
      <name>АвансКлиента</name>
      <description>Avance client</description>
    </items>
    <items>
      <name>ПрибыльОтПродаж</name>
      <description>Bénéfice des ventes</description>
    </items>
    <items>
      <name>НачислениеПоТабелю</name>
      <description>Paie selon la feuille de temps</description>
    </items>
    <items>
      <name>Премия</name>
      <description>Prime</description>
    </items>
    <items>
      <name>Себестоимость</name>
      <description>Prix de revient</description>
    </items>
    <items>
      <name>ПересортицаТоваров</name>
      <description>Reclassement des marchandises</description>
    </items>
    <items>
      <name>УценкаТоваров</name>
      <description>Réductions sur les produits</description>
    </items>
    <items>
      <name>ВыемкаИзКассы</name>
      <description>Retrait de la caisse</description>
    </items>
    <items>
      <name>ВыплатаЗарплаты</name>
      <description>Salaire</description>
    </items>
    <items>
      <name>КурсовыеРазницы</name>
      <description>Écarts de change</description>
    </items>
  </predefined>
  <attributes>
    <name>ДоходыИУбытки</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ВидУбытков</name>
    <type>
      <types>EnumRef.ВидыУбытков</types>
    </type>
  </attributes>
  <attributes>
    <name>Описание</name>
    <type>
      <types>DefinedType.Комментарий</types>
    </type>
  </attributes>
  <tabularSections>
    <name>ТЧХозяйственныеОперации</name>
    <attributes>
      <name>ХозяйственнаяОперация</name>
      <type>
        <types>EnumRef.ХозяйственныеОперации</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

src/cf/src/Documents/ВыплатаЗарплаты/ManagerModule.bsl
Процедура СформироватьВедомость(Док, Таб) Экспорт
	//////////////////////
	// Получаем области //
	//////////////////////	
	Таб.ТолькоПросмотр = Истина;
	Таб.ОтображатьСетку = Ложь;
	Таб.ОтображатьЗаголовки = Ложь;
	Таб.АвтоМасштаб = Истина;
	Макет = Документы.ВыплатаЗарплаты.ПолучитьМакет("Ведомость");
	оШапка = Макет.ПолучитьОбласть("Шапка");
	оСтрока = Макет.ПолучитьОбласть("Строка");
	оПодвал = Макет.ПолучитьОбласть("Подвал");
	////////////////////////////////////////////////////////
	// Получаем всех сотрудников из выбранных документов. // 
	// Это и будет основа для печати ведомости            //
	////////////////////////////////////////////////////////
	Валюта = Константы.ВалютаРегламентированногоУчета.Получить();
	Запрос = Новый Запрос("ВЫБРАТЬ
	                      |	ВыплатаЗПТабличнаяЧасть.Ссылка.Дата КАК Период,
	                      |	ВыплатаЗПТабличнаяЧасть.Ссылка.Дата КАК Дата,
	                      |	ВыплатаЗПТабличнаяЧасть.Ссылка.Номер КАК Номер,
	                      |	ВыплатаЗПТабличнаяЧасть.Сотрудник КАК Сотрудник,
	                      |	ВыплатаЗПТабличнаяЧасть.Сумма КАК Сумма
	                      |ИЗ
	                      |	Документ.ВыплатаЗарплаты.ТЧСотрудники КАК ВыплатаЗПТабличнаяЧасть
	                      |ГДЕ
	                      |	ВыплатаЗПТабличнаяЧасть.Ссылка В(&Документы)
	                      |
	                      |СГРУППИРОВАТЬ ПО
	                      |	ВыплатаЗПТабличнаяЧасть.Сотрудник,
	                      |	ВыплатаЗПТабличнаяЧасть.Ссылка.Дата,
	                      |	ВыплатаЗПТабличнаяЧасть.Сумма,
	                      |	ВыплатаЗПТабличнаяЧасть.Ссылка.Номер,
	                      |	ВыплатаЗПТабличнаяЧасть.Ссылка.Дата
	                      |
	                      |УПОРЯДОЧИТЬ ПО
	                      |	Период,
	                      |	ВыплатаЗПТабличнаяЧасть.Сотрудник.Наименование");
	Запрос.УстановитьПараметр("Документы", Док);
	ТЗСотрудники = Запрос.Выполнить().Выгрузить();
	Ном = 1;
	ТЗСотрудники.Свернуть("Номер, Дата, Сотрудник", "Сумма");
	оШапка.Параметры.Заголовок = "Relevé de paie № " + ТЗСотрудники[0].Номер + " de " + Формат(ТЗСотрудники[0].Дата, "ДЛФ=DD");
	Таб.Вывести(оШапка);
	Для Каждого Стр Из ТЗСотрудники Цикл
		оСтрока.Параметры.Заполнить(Стр);
		оСтрока.Параметры.Ном = Ном;
		Таб.Вывести(оСтрока);
		Ном = Ном + 1;
	КонецЦикла;
	Сумма = ТЗСотрудники.Итог("Сумма");	
	оПодвал.Параметры.Сумма = Сумма;
	оПодвал.Параметры.СуммаПрописью = Формат(Сумма, "ЧДЦ=2") + " (" + Справочники.Валюты.СформироватьСуммуПрописью(Сумма,Валюта,Перечисления.Локализации.fr_CA) + ")";
	Таб.Вывести(оПодвал);		
	ИмяФайла = НСтр("ru = 'Платёжная ведомость'; fr = 'Relevé de paie'; en = 'Payroll statement'; es = 'Nómina'");
	Таб.ИспользуемоеИмяФайла = РаботаСДокументами.КраткоеПредставлениеДокумента(Док, ИмяФайла);
КонецПроцедуры

&НаСервере
Процедура СформироватьРасчетныеЛистки(Док, Таб) Экспорт
	//////////////////////
	// Получаем области //
	//////////////////////
	Макет = Документы.ВыплатаЗарплаты.ПолучитьМакет("РасчетныйЛист");
	оШапка = Макет.ПолучитьОбласть("Шапка");
	оНачУд = Макет.ПолучитьОбласть("НачУд");
	оНачУдВсего = Макет.ПолучитьОбласть("НачУдВсего");
	оАвансы = Макет.ПолучитьОбласть("Авансы");
	оПодвал = Макет.ПолучитьОбласть("Подвал");
	///////////////////////////////////////////////////////////////////////////////
	// Получаем всех сотрудников из выбранных документов с разбивкой по периоду. // 
	// Это и будет основа для печати расчетных листков                           //
	///////////////////////////////////////////////////////////////////////////////
	Запрос = Новый Запрос("ВЫБРАТЬ
	                      |	НАЧАЛОПЕРИОДА(ВыплатаЗПТабличнаяЧасть.Ссылка.Дата, МЕСЯЦ) КАК Период,
	                      |	ВыплатаЗПТабличнаяЧасть.Ссылка.Дата КАК Дата,
	                      |	ВыплатаЗПТабличнаяЧасть.Сотрудник КАК Сотрудник,
	                      |	ЕСТЬNULL(ТарифныеСтавкиСрезПоследних.Должность, ЗНАЧЕНИЕ(Справочник.Должности.ПустаяСсылка)) КАК Должность
	                      |ИЗ
	                      |	Документ.ВыплатаЗарплаты.ТЧСотрудники КАК ВыплатаЗПТабличнаяЧасть
	                      |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ТарифныеСтавки.СрезПоследних(&Период, ) КАК ТарифныеСтавкиСрезПоследних
	                      |		ПО ВыплатаЗПТабличнаяЧасть.Сотрудник = ТарифныеСтавкиСрезПоследних.Сотрудник
	                      |ГДЕ
	                      |	ВыплатаЗПТабличнаяЧасть.Ссылка В(&Документы)
	                      |
	                      |СГРУППИРОВАТЬ ПО
	                      |	ВыплатаЗПТабличнаяЧасть.Сотрудник,
	                      |	ВыплатаЗПТабличнаяЧасть.Ссылка.Дата,
	                      |	ВыплатаЗПТабличнаяЧасть.Сотрудник.Родитель,
	                      |	ТарифныеСтавкиСрезПоследних.Должность
	                      |
	                      |УПОРЯДОЧИТЬ ПО
	                      |	Период,
	                      |	ВыплатаЗПТабличнаяЧасть.Сотрудник.Наименование");
	Запрос.УстановитьПараметр("Документы", Док);
	Запрос.УстановитьПараметр("Период", КонецМесяца(Док.Дата));
	ТЗСотрудники = Запрос.Выполнить().Выгрузить();
	////////////////////
	// Выводим листки //
	////////////////////
	Для Каждого Стр Из ТЗСотрудники Цикл
		// Выводим шапку
		оШапка.Параметры.Заполнить(Стр);
		оШапка.Параметры.Период = Формат(Стр.Период, "ДФ='MMММ yyyy'");
		Таб.Вывести(оШапка);
		// Выводим начисления/удержания
		ТЗНачисленияУдержания = ПолучитьНачисленияУдержания(Стр.Период, Стр.Сотрудник);
		Для Каждого СтрНачУд Из ТЗНачисленияУдержания Цикл
			оНачУд.Параметры.Заполнить(СтрНачУд);
			Если СтрНачУд.ВидНачисления = Справочники.СтатьиДвиженияДенежныхСредств.НачислениеПоТабелю Тогда
				оНачУд.Параметры.Дни = РегистрыСведений.ОтработанноеВремяСотрудников.ПолучитьЗаМесяц(Стр.Период, Стр.Сотрудник).ВыходовФакт;
			Иначе
				оНачУд.Параметры.Дни = 0;
			КонецЕсли;	
			Таб.Вывести(оНачУд);
		КонецЦикла;
		ВсегоНачислено = ТЗНачисленияУдержания.Итог("СуммаНачисления");
		ВсегоУдержано = ТЗНачисленияУдержания.Итог("СуммаУдержания");
		оНачУдВсего.Параметры.ВсегоНачислено = ВсегоНачислено;
		оНачУдВсего.Параметры.ВсегоУдержано = ВсегоУдержано;
        Таб.Вывести(оНачУдВсего);
		// Выводим авансы
		Структура = ПолучитьОстаткиИАвансовыеДокументы(Стр.Период, Стр.Дата, Стр.Сотрудник);
		СуммаАвансов = 0;
		Для Каждого СтрАванс Из Структура.ТЗ Цикл
			оАвансы.Параметры.Заполнить(СтрАванс);
			Таб.Вывести(оАвансы);
			СуммаАвансов = СуммаАвансов + СтрАванс.СуммаАванса;
		КонецЦикла;
		ДолгКон = Структура.ДолгНач + ВсегоНачислено - ВсегоУдержано - СуммаАвансов;
		// Выводим подвал		
		оПодвал.Параметры.Заполнить(Структура);
		оПодвал.Параметры.СуммаАванса = СуммаАвансов;
		оПодвал.Параметры.ДолгКон = ДолгКон;
		Таб.Вывести(оПодвал);
		Таб.ВывестиГоризонтальныйРазделительСтраниц();
	КонецЦикла;
	Таб.ИспользуемоеИмяФайла = НСтр("ru = 'Расчетные листки'; fr = 'Fiches de paie'; en = 'Pay slips'; es = 'Recibos de nómina'");
КонецПроцедуры

&НаСервере
Функция ПолучитьНачисленияУдержания(ПериодНачисления, Сотрудник)
	МасТипыНачислений = Новый Массив;
	МасТипыНачислений.Добавить(Тип("СправочникСсылка.СтатьиДвиженияДенежныхСредств"));
	ТЗ = Новый ТаблицаЗначений;
	ТЗ.Колонки.Добавить("ПериодНачисления", Новый ОписаниеТипов("Дата"));
	ТЗ.Колонки.Добавить("ПериодУдержания", Новый ОписаниеТипов("Дата"));
	ТЗ.Колонки.Добавить("ВидНачисления", Новый ОписаниеТипов(МасТипыНачислений));
	ТЗ.Колонки.Добавить("СуммаНачисления", Новый ОписаниеТипов("Число"));
	ТЗ.Колонки.Добавить("ВидУдержания", Новый ОписаниеТипов(МасТипыНачислений));
	ТЗ.Колонки.Добавить("СуммаУдержания", Новый ОписаниеТипов("Число"));	
	Запрос = Новый Запрос("ВЫБРАТЬ
	                      |	НАЧАЛОПЕРИОДА(Зарплата.Период, ДЕНЬ) КАК Период,
	                      |	Зарплата.Сотрудник КАК Сотрудник,
	                      |	Зарплата.СтатьяЗатрат КАК ВидНачисления,
	                      |	Зарплата.ВидДвижения КАК ВидДвижения,
	                      |	СУММА(Зарплата.Сумма) КАК Сумма
	                      |ИЗ
	                      |	РегистрНакопления.Зарплата КАК Зарплата
	                      |ГДЕ
	                      |	Зарплата.Сотрудник = &Сотрудник
	                      |	И НачалоПериода(Зарплата.Период,Месяц) = &ПериодНачисления
	                      |	И (Зарплата.Регистратор ССЫЛКА Документ.ПриказНаНачислениеУдержание
	                      |			ИЛИ Зарплата.Регистратор ССЫЛКА Документ.НачислениеЗарплаты)
	                      |
	                      |СГРУППИРОВАТЬ ПО
	                      |	НАЧАЛОПЕРИОДА(Зарплата.Период, ДЕНЬ),
	                      |	Зарплата.Сотрудник,
	                      |	Зарплата.СтатьяЗатрат,
	                      |	Зарплата.ВидДвижения
	                      |
	                      |УПОРЯДОЧИТЬ ПО
	                      |	Период,
	                      |	Зарплата.СтатьяЗатрат.Наименование");
	Запрос.УстановитьПараметр("ПериодНачисления", ПериодНачисления);
	Запрос.УстановитьПараметр("Сотрудник", Сотрудник);
	ТЗРез = Запрос.Выполнить().Выгрузить();
	Мас = ТЗРез.НайтиСтроки(Новый Структура("ВидДвижения", ВидДвиженияНакопления.Приход));
	Для Каждого Стр Из Мас Цикл
		НС = ТЗ.Добавить();
		НС.ПериодНачисления = Стр.Период;
		НС.ВидНачисления = Стр.ВидНачисления;
		НС.СуммаНачисления = Стр.Сумма;
	КонецЦикла;
	Мас = ТЗРез.НайтиСтроки(Новый Структура("ВидДвижения", ВидДвиженияНакопления.Расход));
	Для Каждого Стр Из Мас Цикл
		МасТЗ = ТЗ.НайтиСтроки(Новый Структура("ВидУдержания", Неопределено));
		Если МасТЗ.Количество() = 0 Тогда // Новая строка
			НС = ТЗ.Добавить();
			НС.ПериодУдержания = Стр.Период;
			НС.ВидУдержания = Стр.ВидНачисления;
			НС.СуммаУдержания = Стр.Сумма;			
		Иначе // Добавляем в строку с начислением
			НС = МасТЗ[0];
			НС.ПериодУдержания = Стр.Период;
			НС.ВидУдержания = Стр.ВидНачисления;
			НС.СуммаУдержания = Стр.Сумма;	
		КонецЕсли;			
	КонецЦикла;	
	Возврат ТЗ;
КонецФункции

&НаСервере
Функция ПолучитьОстаткиИАвансовыеДокументы(ПериодНачисления, ДатаДокумента, Сотрудник)
	Структура = Новый Структура("ДолгНач, ДолгКон, ТЗ", 0, 0, Новый ТаблицаЗначений);
	// Получим остатки
	Запрос = Новый Запрос("ВЫБРАТЬ
	                      |	ЗарплатаОстаткиИОбороты.Сотрудник КАК Сотрудник,
	                      |	ЗарплатаОстаткиИОбороты.СуммаНачальныйОстаток КАК НачальныйОстаток,
	                      |	ЗарплатаОстаткиИОбороты.СуммаКонечныйОстаток КАК КонечныйОстаток
	                      |ИЗ
	                      |	РегистрНакопления.Зарплата.ОстаткиИОбороты(
	                      |			&ДатаНач,
	                      |			&ДатаКон,
	                      |			,
	                      |			,
	                      |			Сотрудник = &Сотрудник) КАК ЗарплатаОстаткиИОбороты");
	Запрос.УстановитьПараметр("ДатаНач", НачалоМесяца(ПериодНачисления));
	Запрос.УстановитьПараметр("ДатаКон", ДатаДокумента - 1);
	Запрос.УстановитьПараметр("Сотрудник", Сотрудник);
	Выб = Запрос.Выполнить().Выбрать();
	Пока Выб.Следующий() Цикл
		Структура.ДолгНач = Выб.НачальныйОстаток;
		Структура.ДолгКон = Выб.КонечныйОстаток;
	КонецЦикла;
	// Получим аванс
	Запрос = Новый Запрос("ВЫБРАТЬ
	                      |	Зарплата.Период КАК ПериодАванса,
	                      |	Зарплата.Регистратор.Номер КАК Номер,
	                      |	Зарплата.Сумма КАК СуммаАванса,
	                      |	Зарплата.Регистратор КАК Регистратор
	                      |ИЗ
	                      |	РегистрНакопления.Зарплата КАК Зарплата
	                      |ГДЕ
	                      |	НачалоПериода(Зарплата.Период,Месяц) = &ПериодНачисления
	                      |	И Зарплата.Сотрудник = &Сотрудник
	                      |	И (Зарплата.Регистратор ССЫЛКА Документ.ПлатёжнаяВедомостьНаАванс
	                      |			ИЛИ Зарплата.Регистратор ССЫЛКА Документ.РасходныйКассовыйОрдер
	                      |			ИЛИ Зарплата.Регистратор ССЫЛКА Документ.СписаниеБезналичныхДенежныхСредств)
	                      |
	                      |УПОРЯДОЧИТЬ ПО
	                      |	Зарплата.Период");
	Запрос.УстановитьПараметр("ПериодНачисления", ПериодНачисления);
	Запрос.УстановитьПараметр("Сотрудник", Сотрудник);
	ТЗАвансы = Запрос.Выполнить().Выгрузить();
	ТЗАвансы.Колонки.Добавить("ДокАванс", Новый ОписаниеТипов("Строка"));
	Для Каждого Стр Из ТЗАвансы Цикл
		Стр.ДокАванс = Стр.Регистратор;	
	КонецЦикла;
	Структура.ТЗ = ТЗАвансы;
	Возврат Структура;
КонецФункции
